samples/ITI-45_response_raw.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
 <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <wsa:Action xmlns:mustUnderstand="http://www.w3.org/2003/05/soap-envelope" mustUnderstand:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201310UV02</wsa:Action>
  <wsa:RelatesTo>urn:uuid:c12e1f14-c2c9-4a94-ba27-6411e8c90b75</wsa:RelatesTo>
 </soapenv:Header>
 <soapenv:Body>
  <ns1:PRPA_IN201310UV02 xmlns:ns1="urn:hl7-org:v3" ITSVersion="XML_1.0">
   <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.2.3.4.5" extension="30"/>
   <ns1:creationTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:TS" value="20200921170502"/>
   <ns1:versionCode code="V3PR1"/>
   <ns1:interactionId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883" extension="PRPA_IN201310UV02"/>
   <ns1:processingCode code="P"/>
   <ns1:processingModeCode code="T"/>
   <ns1:acceptAckCode code="NE"/>
   <ns1:receiver typeCode="RCV">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.55"/>
    </ns1:device>
   </ns1:receiver>
   <ns1:sender typeCode="SND">
    <ns1:device classCode="DEV" determinerCode="INSTANCE">
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.4.105"/>
    </ns1:device>
   </ns1:sender>
   <ns1:acknowledgement>
    <ns1:typeCode code="AA"/>
    <ns1:targetMessage>
     <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.840.1.113883.1.6.1" extension="1.21600700702136"/>
    </ns1:targetMessage>
   </ns1:acknowledgement>
   <ns1:controlActProcess classCode="CACT" moodCode="EVN">
    <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:CD" code="PRPA_TE201310UV02"/>
    <ns1:subject typeCode="SUBJ">
     <ns1:registrationEvent classCode="REG" moodCode="EVN">
      <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" nullFlavor="NA"/>
      <ns1:statusCode code="active"/>
      <ns1:subject1 typeCode="SBJ">
       <ns1:patient classCode="PAT">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.45" extension="799b00ee-2f2a-4444-8f93-c91730578af4" assigningAuthorityName="XDS Affinity Domain"/>
        <ns1:statusCode code="active"/>
        <ns1:patientPerson classCode="PSN" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:PN" nullFlavor="NA"/>
         <ns1:asOtherIDs classCode="ROL">
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.756.5.30.1.127.3.10.3" extension="761337610435209810" assigningAuthorityName="SPID"/>
          <ns1:scopingOrganization classCode="ORG" determinerCode="INSTANCE">
           <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="2.16.756.5.30.1.127.3.10.3"/>
          </ns1:scopingOrganization>
         </ns1:asOtherIDs>
        </ns1:patientPerson>
       </ns1:patient>
      </ns1:subject1>
      <ns1:custodian typeCode="CST">
       <ns1:assignedEntity classCode="ASSIGNED">
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2010.1.2.600" extension="xxx"/>
        <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2010.1.2.600" extension="xxx"/>
        <ns1:assignedOrganization classCode="ORG" determinerCode="INSTANCE">
         <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:EN">
          <ns1:given>org</ns1:given>
         </ns1:name>
        </ns1:assignedOrganization>
       </ns1:assignedEntity>
      </ns1:custodian>
     </ns1:registrationEvent>
    </ns1:subject>
    <ns1:queryAck>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="4ecd362e-8d17-4abe-b991-3793bc2e1399"/>
     <ns1:statusCode code="deliveredResponse"/>
     <ns1:queryResponseCode code="OK"/>
    </ns1:queryAck>
    <ns1:queryByParameter>
     <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="4ecd362e-8d17-4abe-b991-3793bc2e1399"/>
     <ns1:statusCode code="new"/>
     <ns1:responsePriorityCode code="I"/>
     <ns1:parameterList>
      <ns1:dataSource>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.21367.2017.2.5.45"/>
       <ns1:semanticsText>DataSource.id</ns1:semanticsText>
      </ns1:dataSource>
      <ns1:patientIdentifier>
       <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:II" root="1.3.6.1.4.1.12559.11.25.1.19" extension="CHFACILITY9810"/>
       <ns1:semanticsText>Patient.Id</ns1:semanticsText>
      </ns1:patientIdentifier>
     </ns1:parameterList>
    </ns1:queryByParameter>
   </ns1:controlActProcess>
  </ns1:PRPA_IN201310UV02>
 </soapenv:Body>
</soapenv:Envelope>
